In [1423]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split as tts
from sklearn.preprocessing import LabelEncoder

df = pd.read_csv('csv/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [1093]:
inputs = df.drop(columns='salary_more_then_100k')
target = df['salary_more_then_100k']

In [1381]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

inputs['company_n'] = le_company.fit_transform(inputs.company)
inputs['job_n'] = le_job.fit_transform(inputs.job)
inputs['degree_n'] = le_degree.fit_transform(inputs.degree)
inputs

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [1111]:
inputs_n = inputs.drop(columns=['company','degree', 'job'])
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [1429]:
from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier()
X_train, X_test, y_train, y_test = train_test_split(inputs_n, target, test_size=0.2)

model.fit(X_train, y_train)
print(f'{model.score(X_test, y_test)}')
tryouts = [[1,1,0], [1,2,0], [2,1,0], [2,0,1], [0,1,0], [0,1,1]]
predictions = model.predict(tryouts)

0.75

In [1431]:
company_names = np.unique(le_company.inverse_transform(inputs.company_n))
job_names = np.unique(le_job.inverse_transform(inputs.job_n))
degree_names = np.unique(le_degree.inverse_transform(inputs.degree_n))

for i in range(len(tryouts)):
    company_index = tryouts[i][0]
    job_index = tryouts[i][1]
    degree_index = tryouts[i][2]
    
    company = company_names[company_index]
    job = job_names[job_index]
    degree = degree_names[degree_index]
    
    print(f'\ninput: [{company}, {job}, {degree}]')
    print(f'prediction of high salary: {predictions[i]==1}')

input: [facebook, computer programmer, bachelors]
prediction of high salary: True

input: [facebook, sales executive, bachelors]
prediction of high salary: True

input: [google, computer programmer, bachelors]
prediction of high salary: False

input: [google, business manager, masters]
prediction of high salary: True

input: [abc pharma, computer programmer, bachelors]
prediction of high salary: False

input: [abc pharma, computer programmer, masters]
prediction of high salary: True